0Bu/tesla-key-esp32/main/ota_update.cpp
#include "ota_update.hpp"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"

#include <esp_log.h>
#include <esp_system.h>
#include <esp_app_desc.h>
#include <esp_http_client.h>
#include <esp_https_ota.h>
#include <esp_heap_caps.h>
#include <esp_ota_ops.h>
#include <esp_crt_bundle.h>
#include <cJSON.h>

#include "logic/heap_watchdog.hpp"
#include "logic/json_syntax.hpp"
#include "logic/ota_contract.hpp"
#include "ble_client.hpp"
#include "ota_manifest.hpp"
#include "platform.hpp"
#include "runtime_admission.hpp"
#include "task_config.hpp"
#include "rtos_guard.hpp"

#include <atomic>
#include <cstring>
#include <exception>
#include <memory>
#include <string_view>

static const char* TAG = "ota";

// One atomic owner word closes the OTA/identity/fault-restart TOCTOU windows. A separate
// `s_running` boolean can answer status questions, but cannot serialize "checked false, then OTA
// started". Every OTA worker owns Ota from before task creation until it exits/reboots; every
// key/VIN transaction owns IdentityMutation for its complete journal + NVS mutation lifetime; a
// fault restart owns FaultRestart from before reboot_why is persisted until restart (or releases
// it when persistence fails).
static tk::OtaIdentityOperationGate s_operation_gate;

static bool try_begin_ota_operation() {
    return s_operation_gate.try_begin(tk::OtaIdentityGateState::Ota);
}

static void finish_operation(tk::OtaIdentityGateState owner) {
    if (!s_operation_gate.finish(owner)) {
        // Never clear a different owner's gate: doing so would turn an invariant violation into
        // permission for a real overlapping reboot/mutation. Leave it fail-closed and diagnose.
        ESP_LOGE(TAG, "OTA/identity operation gate owner mismatch (expected=%d, actual=%d)",
                 static_cast<int>(owner), static_cast<int>(s_operation_gate.state()));
    }
}

tk::OtaVerificationState ota_verification_state() {
    const esp_partition_t* running = esp_ota_get_running_partition();
    if (!running) return tk::OtaVerificationState::Unknown;

    esp_ota_img_states_t state{};
    if (esp_ota_get_state_partition(running, &state) != ESP_OK)
        return tk::OtaVerificationState::Unknown;
    switch (state) {
        case ESP_OTA_IMG_UNDEFINED:
        case ESP_OTA_IMG_VALID:
            return tk::OtaVerificationState::Stable;
        case ESP_OTA_IMG_NEW:
        case ESP_OTA_IMG_PENDING_VERIFY:
            return tk::OtaVerificationState::PendingVerify;
        default:
            // INVALID/ABORTED cannot normally be the running partition. If storage reports such
            // a state, it is not authority to begin an irreversible cross-version identity write.
            return tk::OtaVerificationState::Unknown;
    }
}

bool ota_identity_mutation_allowed(tk::IdentityMutationEntry entry) {
    return tk::identity_mutation_may_start(
        ota_verification_state(),
        s_operation_gate.state(), entry);
}

OtaIdentityMutationGuard::OtaIdentityMutationGuard(tk::IdentityMutationEntry entry) {
    const tk::OtaVerificationState before = ota_verification_state();
    const auto expected = s_operation_gate.state();
    if (!tk::identity_mutation_may_start(before, expected, entry)) return;
    if (!s_operation_gate.try_begin(tk::OtaIdentityGateState::IdentityMutation)) {
        return;
    }

    // Re-sample after acquiring exclusivity. An OTA start racing the first sample either won the
    // CAS (so we never get here) or is now blocked. Any other state change/error remains
    // non-authoritative and releases the gate without permitting a write.
    if (!tk::identity_mutation_allowed(ota_verification_state(), entry)) {
        finish_operation(tk::OtaIdentityGateState::IdentityMutation);
        return;
    }
    held_ = true;
}

OtaIdentityMutationGuard::~OtaIdentityMutationGuard() {
    if (held_) finish_operation(tk::OtaIdentityGateState::IdentityMutation);
}

bool ota_fault_restart_begin() {
    return s_operation_gate.try_begin(tk::OtaIdentityGateState::FaultRestart);
}

void ota_fault_restart_cancel() {
    finish_operation(tk::OtaIdentityGateState::FaultRestart);
}

OtaHealthCommitGuard::OtaHealthCommitGuard()
    : held_(s_operation_gate.try_begin(tk::OtaIdentityGateState::HealthCommit)) {}

OtaHealthCommitGuard::~OtaHealthCommitGuard() {
    if (held_) finish_operation(tk::OtaIdentityGateState::HealthCommit);
}

// Confirm a still-unverified OTA image before a successful network/logging/setup commit reboot —
// see the header. Mirrors the mark-valid path in main.cpp's ota_health_gate_task, but fires once the
// durable commit AND the post-admission heap sample prove the runtime healthy. Identity mutations
// deliberately never reach this path. A qualifying restart inside the health window must not
// trigger a rollback unless the image is already critically heap-starved.
void ota_confirm_pending_image(tk::OtaRebootClass reboot_class) {
    if (!tk::ota_reboot_confirms_pending_image(reboot_class)) {
        ESP_LOGE(TAG, "refusing OTA confirmation for non-user recovery reboot class %d",
                 static_cast<int>(reboot_class));
        return;
    }

    // The user commit is valid health evidence, but mark-valid is still the same irreversible
    // operation as the timed health gate. Serialize it against a persisted FaultRestart window,
    // OTA and identity work; if another owner won, leave PENDING_VERIFY armed so the imminent
    // reboot fails closed into rollback instead of crossing that owner's shutdown transaction.
    OtaHealthCommitGuard commit_guard;
    if (!commit_guard) {
        ESP_LOGW(TAG, "OTA image confirmation postponed by an active operation; rollback remains armed");
        return;
    }
    // A durable configuration write is not proof that the essential runtime started. In
    // particular, recovery HTTP remains available in Safe Mode and during a partial boot. Check
    // admission only after owning HealthCommit so Ready cannot race a FaultRestart/OTA owner; all
    // non-Ready states leave the one automatic rollback armed.
    if (!tk::runtime_admission_vehicle_ready()) {
        ESP_LOGW(TAG, "OTA image confirmation refused: essential runtime is not ready; "
                      "rollback remains armed");
        return;
    }
    if (!ble_host_synced()) {
        ESP_LOGW(TAG, "OTA image confirmation refused: NimBLE host is not synced; "
                      "rollback remains armed");
        return;
    }
    if (ble_host_reset_count() != 0) {
        ESP_LOGW(TAG, "OTA image confirmation refused: NimBLE host reset since admission; "
                      "rollback remains armed");
        return;
    }
    // Re-sample only after winning the same exclusive owner as the timed health gate. A healthy
    // sample taken before the CAS could become stale while FaultRestart persists its breadcrumb;
    // crossing that window would permanently validate the image immediately before it reboots.
    const size_t commit_largest = heap_caps_get_largest_free_block(
        MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
    if (commit_largest < tk::kHeapCriticalBytes) {
        ESP_LOGW(TAG, "OTA image confirmation refused: internal largest block %u B < %u B; "
                      "rollback remains armed",
                 static_cast<unsigned>(commit_largest),
                 static_cast<unsigned>(tk::kHeapCriticalBytes));
        return;
    }
    const esp_partition_t* running = esp_ota_get_running_partition();
    esp_ota_img_states_t st;
    if (esp_ota_get_state_partition(running, &st) == ESP_OK &&
        st == ESP_OTA_IMG_PENDING_VERIFY) {
        if (esp_ota_mark_app_valid_cancel_rollback() == ESP_OK)
            ESP_LOGI(TAG, "OTA image confirmed valid before a user-initiated reboot (rollback cancelled)");
    }
}

// Short per-target image suffix so "esp32" appears only once in the OTA filename: esp32 ->
// "" (tesla-key-esp32.bin), esp32s3 -> "-s3", esp32c3 -> "-c3", esp32c6 -> "-c6".
// Must stay in lockstep with the signer/Pages target tables and the host-tested
// tk::image_suffix() mapping (which name the published asset the device pulls) — a mismatch
// 404s every OTA download.
// Kept as a string-literal macro because the download URL is assembled by compile-time
// concatenation below; the static_assert ties it to the host-tested tk::image_suffix()
// so the macro and the pure mapping can never drift.
#if   defined(CONFIG_IDF_TARGET_ESP32)
#  define TESLA_OTA_IMG_SUFFIX ""
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
#  define TESLA_OTA_IMG_SUFFIX "-s3"
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
#  define TESLA_OTA_IMG_SUFFIX "-c3"
#elif defined(CONFIG_IDF_TARGET_ESP32C6)
#  define TESLA_OTA_IMG_SUFFIX "-c6"
#else
#  error "Unsupported CONFIG_IDF_TARGET for OTA image naming"
#endif
static_assert(std::string_view{TESLA_OTA_IMG_SUFFIX} == tk::image_suffix(TK_TARGET),
              "OTA image suffix macro drifted from tk::image_suffix()");

// ─── Shared status (written by the OTA task, read by HTTP handlers) ────────────

static std::atomic<SemaphoreHandle_t> s_lock{nullptr};
static OtaStatus                     s_status = { OtaState::Idle, 0, "idle", "", false, "" };
static std::atomic<bool>             s_running{false};    // a check or download task is active

static SemaphoreHandle_t ensure_lock() {
    SemaphoreHandle_t lock = s_lock.load(std::memory_order_acquire);
    if (lock) return lock;

