0Bu/tesla-key-esp32/main/ota_update.cpp
    SemaphoreHandle_t candidate = xSemaphoreCreateMutex();
    if (!candidate) return nullptr;
    if (!s_lock.compare_exchange_strong(lock, candidate,
                                        std::memory_order_release,
                                        std::memory_order_acquire)) {
        vSemaphoreDelete(candidate);
        return lock;
    }
    return candidate;
}

// The status fields are std::string, so every assignment/copy below can throw bad_alloc on a
// fragmented heap. RAII (tk::SemGuard) releases s_lock during unwinding, so a throw here can't
// wedge the lock and freeze /ota/status for the rest of the boot.
static void set_state(OtaState st, int pct, const char* msg) {
    SemaphoreHandle_t lock = ensure_lock();
    if (!lock) return;
    tk::SemGuard g(lock);
    if (!g) return;
    s_status.state    = st;
    s_status.progress = pct;
    s_status.message  = msg ? msg : "";
}

static void set_available(const char* ver) {
    SemaphoreHandle_t lock = ensure_lock();
    if (!lock) return;
    tk::SemGuard g(lock);
    if (!g) return;
    s_status.available = ver ? ver : "";
}

static OtaStatus unavailable_status_snapshot() {
    // This object is built independently of s_status. It may still throw if the standard library
    // cannot represent even these short strings under total OOM (callers already contain that),
    // but it can never race a writer or copy a concurrently-reallocated std::string buffer.
    return {OtaState::Error, 0, "unavailable", "", false, ""};
}

OtaStatus ota_get_status() {
    SemaphoreHandle_t lock = ensure_lock();
    if (!lock) return unavailable_status_snapshot();
    tk::SemGuard g(lock);
    if (!g) return unavailable_status_snapshot();
    return s_status;
}

bool ota_is_busy() {
    return s_running.load(std::memory_order_acquire) ||
           s_operation_gate.state() ==
               tk::OtaIdentityGateState::Ota;
}

// ─── Canonical, bounded version input ──────────────────────────────────────────

static std::string_view running_version() {
    const esp_app_desc_t* description = esp_app_get_description();
    return description ? tk::bounded_c_string_view(description->version) : std::string_view{};
}

// ─── Small HTTPS GET into a buffer (for the tiny manifest.json) ─────────────────

static bool http_get_to_buffer(const char* url, std::string& out) {
    out.clear();
    esp_http_client_config_t cfg = {};
    cfg.url               = url;
    cfg.crt_bundle_attach = esp_crt_bundle_attach;   // verify against bundled CA roots
    cfg.timeout_ms        = 10000;

    esp_http_client_handle_t c = esp_http_client_init(&cfg);
    if (!c) return false;
    struct HttpClientGuard {
        esp_http_client_handle_t handle;
        ~HttpClientGuard() {
            esp_http_client_close(handle);
            esp_http_client_cleanup(handle);
        }
    } client_guard{c};

    if (esp_http_client_open(c, 0) == ESP_OK) {
        const std::int64_t content_length = esp_http_client_fetch_headers(c);
        const int status = esp_http_client_get_status_code(c);
        if (status == 200) {
            const bool chunked = esp_http_client_is_chunked_response(c);
            tk::BoundedHttpBodyGate body_gate(content_length, chunked);
            if (!body_gate.valid_headers()) {
                ESP_LOGW(TAG, "manifest length is missing, empty or exceeds %u bytes",
                         static_cast<unsigned>(tk::kOtaManifestMaxBytes));
                return false;
            }

            // One exact bounded allocation: repeated append growth can transiently require both
            // the old and new contiguous blocks while TLS is still live. Fixed-length responses
            // reserve their declared size; chunked responses reserve the hard 8192-byte ceiling.
            try {
                out.reserve(chunked ? tk::kOtaManifestMaxBytes
                                    : static_cast<std::size_t>(content_length));
            } catch (...) {
                ESP_LOGW(TAG, "manifest buffer allocation failed");
                return false;
            }

            char buf[512];
            while (true) {
                const std::size_t requested = body_gate.next_read_size(sizeof(buf));
                if (requested == 0) {
                    out.clear();
                    return false;
                }
                const int read = esp_http_client_read(c, buf, static_cast<int>(requested));
                const auto decision = body_gate.accept_read(
                    read, esp_http_client_is_complete_data_received(c));
                if (decision == tk::BoundedBodyReadResult::Reject) {
                    ESP_LOGW(TAG, "manifest response was truncated, oversized or read failed");
                    out.clear();
                    return false;
                }
                if (read > 0) out.append(buf, static_cast<std::size_t>(read));
                if (decision == tk::BoundedBodyReadResult::Complete) return true;
            }
        } else {
            ESP_LOGW(TAG, "manifest HTTP status %d", status);
        }
    } else {
        ESP_LOGW(TAG, "manifest connection failed");
    }

    out.clear();
    return false;
}

// ─── Check for a newer release ──────────────────────────────────────────────────

OtaCheckResult ota_check() {
    OtaCheckResult res{};
    const std::string_view current = running_version();
    res.current.assign(current.data(), current.size());

    set_state(OtaState::Checking, 0, "checking for updates");
    ESP_LOGI(TAG, "checking %s (running %s)", CONFIG_TESLA_OTA_MANIFEST_URL, res.current.c_str());

    std::string body;
    if (!http_get_to_buffer(CONFIG_TESLA_OTA_MANIFEST_URL, body)) {
        res.ok     = false;
        res.reason = "could not reach update server";
        set_state(OtaState::Idle, 0, "check failed");
        return res;
    }

    const char* parse_end = nullptr;
    const auto materialized = tk::json_materialize<cJSON>(
        body.data(), body.size(), [&](const char* text) {
            return cJSON_ParseWithLengthOpts(
                text, body.size() + 1, &parse_end, true);
        });
    if (materialized.status != tk::JsonMaterializeStatus::Ok) {
        res.ok     = false;
        res.reason = materialized.status == tk::JsonMaterializeStatus::NoMemory
                         ? "update manifest ran out of resources"
                         : "invalid update manifest";
        set_state(OtaState::Idle, 0, "check failed");
        return res;
    }
    std::unique_ptr<cJSON, decltype(&cJSON_Delete)> j(materialized.root, cJSON_Delete);
    const tk::OtaManifestVersion manifest = tk::inspect_ota_manifest(j.get());
    if (parse_end != body.c_str() + body.size() ||
        manifest.status != tk::OtaManifestInspectStatus::Valid || !manifest.value) {
        res.ok     = false;
        res.reason = "invalid update manifest";
        set_state(OtaState::Idle, 0, "check failed");
        return res;
    }
    // cJSON owns decoded strings. Release the bounded transport body before any result-string
    // allocation so the largest-block peak is body+cJSON, never body+cJSON+another body-sized copy.
    std::string{}.swap(body);
    const std::string_view available(manifest.value);
    // Validate the cJSON-owned view before copying: an attacker-controlled ~8 KiB version must
    // not trigger another large contiguous std::string allocation while TLS/body/cJSON coexist.
    if (!tk::canonical_ota_version(available)) {
        res.ok     = false;
        res.reason = "invalid version in manifest";
        set_state(OtaState::Idle, 0, "check failed");
        return res;
    }
    if (!tk::canonical_ota_version(res.current)) {
        res.ok     = false;
        res.reason = "invalid running firmware version";
        set_state(OtaState::Idle, 0, "check failed");
        return res;
    }
    res.available.assign(available.data(), available.size());

    res.ok               = true;
    res.update_available = tk::compare_ota_versions(res.available, res.current) ==
                           tk::OtaVersionOrder::Newer;
    res.reason           = res.update_available ? "update available" : "up to date";
    set_available(res.available.c_str());
    set_state(OtaState::Idle, 0, res.reason.c_str());
    ESP_LOGI(TAG, "available %s — %s", res.available.c_str(), res.reason.c_str());
    return res;
}

// Publish a finished check into the shared status for /ota/status polling.
static void set_check_done(const OtaCheckResult& r) {
    SemaphoreHandle_t lock = ensure_lock();
    if (!lock) return;
    tk::SemGuard g(lock);   // RAII: the std::string assigns below can throw
    if (!g) return;
    s_status.state            = r.ok ? OtaState::Idle : OtaState::Error;
    s_status.progress         = 0;
    s_status.message          = r.reason;
    s_status.available        = r.available;
    s_status.update_available = r.update_available;
    s_status.current          = r.current;
}

static void ota_check_task(void*) {
    try {
        // A one-shot job: contain any throw (http_get_to_buffer's std::string appends, cJSON, the
        // status std::string ops can all bad_alloc) as a terminal Error state — NEVER let it unwind
        // into the FreeRTOS C trampoline and reboot the device mid-check (issue #204).
        try {
            OtaCheckResult r = ota_check();   // blocking HTTPS GET, runs off the HTTP task
            set_check_done(r);
        } catch (const std::exception& e) {
            ESP_LOGE(TAG, "OTA check task exception: %s", e.what());
            try { set_state(OtaState::Error, 0, "update check ran out of resources"); } catch (...) {}
        } catch (...) {
            ESP_LOGE(TAG, "OTA check task unknown exception");
            try { set_state(OtaState::Error, 0, "update check failed unexpectedly"); } catch (...) {}
        }
        s_running.store(false, std::memory_order_release);
        finish_operation(tk::OtaIdentityGateState::Ota);
        vTaskDelete(nullptr);
    } catch (...) {
        // The outer boundary also contains any future throwing setup/cleanup statement added
        // around the operation-specific handler above.
        ESP_LOGE(TAG, "OTA check boundary cleanup threw; stopping task");
        s_running.store(false, std::memory_order_release);
        finish_operation(tk::OtaIdentityGateState::Ota);
        vTaskDelete(nullptr);
    }
}

bool ota_check_start() {
    if (!ensure_lock()) return false;
    // Acquire the cross-domain gate before publishing/starting the worker. This atomically loses
    // to an in-flight key/VIN transaction instead of sampling a separate busy flag and racing it.
    if (!try_begin_ota_operation()) return false;
    if (s_running.exchange(true, std::memory_order_acq_rel)) {
        finish_operation(tk::OtaIdentityGateState::Ota);
        return false;
    }
    try {
        set_state(OtaState::Checking, 0, "checking for updates");
    } catch (...) {
        s_running.store(false, std::memory_order_release);
        finish_operation(tk::OtaIdentityGateState::Ota);
        return false;
    }

