0Bu/tesla-key-esp32/main/ota_update.cpp
    // mbedTLS handshake + manifest fetch run here; same generous stack as ota_task.
    if (xTaskCreate(ota_check_task, "ota_chk", 8192, nullptr, tk::kPrioOtaCheck, nullptr) != pdPASS) {
        s_running.store(false, std::memory_order_release);
        finish_operation(tk::OtaIdentityGateState::Ota);
        try { set_state(OtaState::Error, 0, "could not start check task"); } catch (...) {}
        return false;
    }
    return true;
}

// ─── Background download + install ──────────────────────────────────────────────

static void ota_task_impl() {
    // Re-fetch the manifest HERE rather than trusting whatever a previous /ota/check left in the
    // shared status. Two independent reasons: POST /ota/update is reachable on its own, so gating
    // only inside the check would mean no gate at all for a direct caller; and the manifest could
    // have moved between the check and the confirmation. Costs one small HTTPS GET on this task —
    // never on a request path.
    const OtaCheckResult pre = ota_check();
    if (!pre.ok) {
        ESP_LOGE(TAG, "OTA refused: %s", pre.reason.c_str());
        set_state(OtaState::Error, 0, pre.reason.c_str());
        return;
    }
    if (!pre.update_available) {
        ESP_LOGW(TAG, "OTA refused: manifest %s is not newer than running %s",
                 pre.available.c_str(), pre.current.c_str());
        set_state(OtaState::Error, 0, "no newer version available");
        return;
    }

    // One channel, per-target image: base URL + this chip's short image suffix. The literals
    // concatenate at compile time (TESLA_OTA_IMG_SUFFIX is a string literal), so this is a
    // fixed string with no allocation. esp_https_ota also verifies the image chip-id, so a
    // wrong-target image (e.g. an esp32s3 build pulled by an esp32) is refused, not flashed.
    static constexpr const char* kFwUrl =
        CONFIG_TESLA_OTA_FIRMWARE_BASE_URL "tesla-key-esp32" TESLA_OTA_IMG_SUFFIX ".bin";
    ESP_LOGI(TAG, "OTA starting from %s (free heap %u)",
             kFwUrl, (unsigned)esp_get_free_heap_size());

    esp_http_client_config_t http_cfg = {};
    http_cfg.url               = kFwUrl;
    http_cfg.crt_bundle_attach = esp_crt_bundle_attach;
    http_cfg.timeout_ms        = 20000;
    http_cfg.keep_alive_enable = true;

    esp_https_ota_config_t ota_cfg = {};
    ota_cfg.http_config = &http_cfg;

    esp_https_ota_handle_t handle = nullptr;
    esp_err_t err = esp_https_ota_begin(&ota_cfg, &handle);
    if (err != ESP_OK || handle == nullptr) {
        ESP_LOGE(TAG, "esp_https_ota_begin failed: %s", esp_err_to_name(err));
        set_state(OtaState::Error, 0, "could not start download (server/TLS)");
        return;
    }
    struct OtaHandleGuard {
        esp_https_ota_handle_t handle;
        ~OtaHandleGuard() { if (handle) esp_https_ota_abort(handle); }
        esp_https_ota_handle_t release() {
            auto h = handle;
            handle = nullptr;
            return h;
        }
    } handle_guard{handle};

    int image_size = esp_https_ota_get_image_size(handle);

    // Downgrade defense (software anti-rollback, no eFuses burned by design). The image is
    // RSA-signed and esp_https_ota verifies that, but a signature only proves AUTHENTICITY,
    // not FRESHNESS: an attacker controlling the update host could serve an OLD, legitimately
    // signed image carrying a since-patched vulnerability. Read the version straight from the
    // downloaded image's own app descriptor (esp_https_ota_get_img_desc parses only the header,
    // before the bulk download) and refuse anything not strictly newer than what is running.
    // Checking the image itself — not the manifest — also closes the gap where a hostile host
    // advertises a new version in manifest.json but serves an old .bin under the image URL.
    esp_app_desc_t new_app{};
    err = esp_https_ota_get_img_desc(handle, &new_app);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_https_ota_get_img_desc failed: %s", esp_err_to_name(err));
        set_state(OtaState::Error, 0, "could not read image header");
        return;
    }
    const std::string_view new_version = tk::bounded_c_string_view(new_app.version);
    const std::string_view current_version = running_version();
    if (!tk::canonical_ota_version(new_version) ||
        !tk::canonical_ota_version(current_version)) {
        ESP_LOGW(TAG, "OTA refused: image or running version is malformed");
        set_state(OtaState::Error, 0, "invalid firmware version");
        return;
    }
    if (tk::compare_ota_versions(new_version, current_version) !=
        tk::OtaVersionOrder::Newer) {
        ESP_LOGW(TAG, "OTA refused: image %.*s not newer than running %.*s (downgrade blocked)",
                 static_cast<int>(new_version.size()), new_version.data(),
                 static_cast<int>(current_version.size()), current_version.data());
        set_state(OtaState::Error, 0, "no newer version available");
        return;
    }

    // SECOND point of the gate: the manifest and the image must name the SAME version.
    //
    // The freshness check above is necessary but not sufficient, and the gap is easy to miss: the
    // manifest and the .bin are two separately-controlled artifacts. A host serving manifest 1.9.0
    // beside a 1.8.0 image passes every check individually — the image is signed, and 1.8.0 really
    // is newer than a device running 1.7.0 — so the device installs a build the operator never
    // published, while the UI reports the version the manifest claimed. Requiring the two strings
    // to match exactly turns "the newest thing the host is willing to serve" back into "the build
    // the release actually is". Also catches the ordinary, far more likely case: a publish that
    // wrote a new manifest beside a stale image.
    if (std::string_view(pre.available) != new_version) {
        ESP_LOGE(TAG, "OTA refused: manifest advertises %s but the image is %.*s — the manifest and "
                      "the image disagree, so neither can be trusted to be the published release",
                 pre.available.c_str(), static_cast<int>(new_version.size()), new_version.data());
        set_state(OtaState::Error, 0, "manifest and image versions disagree");
        return;
    }
    ESP_LOGI(TAG, "OTA image %.*s newer than running %.*s and matches the manifest — proceeding",
             static_cast<int>(new_version.size()), new_version.data(),
             static_cast<int>(current_version.size()), current_version.data());

    while (true) {
        err = esp_https_ota_perform(handle);
        if (err != ESP_ERR_HTTPS_OTA_IN_PROGRESS) break;
        int read = esp_https_ota_get_image_len_read(handle);
        int pct  = (image_size > 0) ? (int)((int64_t)read * 100 / image_size) : 0;
        set_state(OtaState::Downloading, pct, "downloading");
    }

    if (err == ESP_OK && esp_https_ota_is_complete_data_received(handle)) {
        err = esp_https_ota_finish(handle_guard.release());
        if (err == ESP_OK) {
            ESP_LOGI(TAG, "OTA complete — rebooting into new image");
            set_state(OtaState::Done, 100, "update complete — rebooting");
            vTaskDelay(pdMS_TO_TICKS(1200));
            esp_restart();   // does not return
        }
        ESP_LOGE(TAG, "esp_https_ota_finish failed: %s", esp_err_to_name(err));
        set_state(OtaState::Error, 0,
                  err == ESP_ERR_OTA_VALIDATE_FAILED ? "downloaded image is invalid"
                                                     : "could not finalize update");
    } else {
        ESP_LOGE(TAG, "OTA download failed: %s", esp_err_to_name(err));
        set_state(OtaState::Error, 0, "download failed");
    }
}

static void ota_task(void*) {
    try {
        try {
            ota_task_impl();
        } catch (const std::exception& e) {
            ESP_LOGE(TAG, "OTA task exception: %s", e.what());
            try { set_state(OtaState::Error, 0, "update ran out of resources"); } catch (...) {}
        } catch (...) {
            ESP_LOGE(TAG, "OTA task unknown exception");
            try { set_state(OtaState::Error, 0, "update failed unexpectedly"); } catch (...) {}
        }
        s_running.store(false, std::memory_order_release);
        finish_operation(tk::OtaIdentityGateState::Ota);
        vTaskDelete(nullptr);
    } catch (...) {
        ESP_LOGE(TAG, "OTA task boundary cleanup threw; stopping task");
        s_running.store(false, std::memory_order_release);
        finish_operation(tk::OtaIdentityGateState::Ota);
        vTaskDelete(nullptr);
    }
}

bool ota_start() {
    if (!ensure_lock()) return false;
    // The same owner word excludes both a second OTA and every identity transaction. On a
    // successful install it remains owned until esp_restart(); on every returning path the task
    // releases it below.
    if (!try_begin_ota_operation()) return false;
    if (s_running.exchange(true, std::memory_order_acq_rel)) {
        finish_operation(tk::OtaIdentityGateState::Ota);
        return false;
    }
    try {
        set_state(OtaState::Downloading, 0, "starting download");
    } catch (...) {
        s_running.store(false, std::memory_order_release);
        finish_operation(tk::OtaIdentityGateState::Ota);
        return false;
    }

    // A generous stack: mbedTLS record processing + esp_https_ota run here.
    if (xTaskCreate(ota_task, "ota", 8192, nullptr, tk::kPrioOta, nullptr) != pdPASS) {
        s_running.store(false, std::memory_order_release);
        finish_operation(tk::OtaIdentityGateState::Ota);
        try { set_state(OtaState::Error, 0, "could not start OTA task"); } catch (...) {}
        return false;
    }
    return true;
}
